*&---------------------------------------------------------------------*
*& Include          YCL115_002_PBO
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Module STATUS_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE STATUS_0100 OUTPUT.
 SET PF-STATUS '0100'.
 SET TITLEBAR '0100'.
ENDMODULE.
*&---------------------------------------------------------------------*
*& Module INIT_ALV_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE INIT_ALV_0100 OUTPUT.

  IF GR_ALV IS BOUND.
    PERFORM REFRESH_GRID_0100.      "만들어져있으면 새로고침하겠다,새로고침하는이유는 내가 준 인터널테이블의내용을 최신내용으로 갱신하라는 의미
  ELSE.
    PERFORM CREATE_OBJECT_0100.     "없으면 만들겠다.
    PERFORM SET_ALV_LAYOUT_0100.    "필드카탈로그 세팅
    PERFORM SET_ALV_FIELDCAT_0100.  "필드카탈로그설정,여기서세팅된 필드만 화면에보인다.
    PERFORM DISPLAY_ALV_0100.
  ENDIF.

ENDMODULE.
