*&---------------------------------------------------------------------*
*& Include          YCL115_001_PBO
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Module STATUS_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE STATUS_0100 OUTPUT.
 SET PF-STATUS '0100'.
 SET TITLEBAR  '0100'.
ENDMODULE.
*&---------------------------------------------------------------------*
*& Module INIT_ALV_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE INIT_ALV_0100 OUTPUT.

*IF GR_CON IS INITIAL.  "INITIAL = 변수가 초기상태인가?
*  "초기상태이므로 생성과정로직이 들어간다
*ELSE.
*  "이미 만들어진 상태이므로 새로고침 로직이 들어간다.(CREATE OBJECT)
*ENDIF.


IF GR_CON IS BOUND.    "BOUND = 구체적인조건이다. 참조변수에 연결된객체가 있는가? 라고 묻는것.
  "이미 만들어진 상태이므로 새로고침 로직이 들어간다.
ELSE.
    "초기상태이므로 생성과정로직이 들어간다.
  PERFORM CREATE_OBJECT_0100.     "CONTAINER, ALV 참조변수 객체생성
  PERFORM SET_ALV_LAYOUT_0100.    "ALV LAYOUT 설정
  PERFORM SET_ALV_FIELDCAT_0100.  "ALV FIELD CATALOG설정,여기서세팅된 필드만 화면에보인다.
  PERFORM DISPLAY_ALV_0100.
ENDIF.

ENDMODULE.
