*&---------------------------------------------------------------------*
*& Module Pool      YCL115_002
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
PROGRAM YCL115_003.

INCLUDE YCL115_003_TOP.
*INCLUDE YCL115_002_TOP.  "전역변수
INCLUDE YCL115_003_CLS.
*INCLUDE YCL115_002_CLS.  "ALV를관련내용들
INCLUDE YCL115_003_PBO.
*INCLUDE YCL115_002_PBO.  "화면 출력전
INCLUDE YCL115_003_PAI.
*INCLUDE YCL115_002_PAI.  "화면 출력후
INCLUDE YCL115_003_F01.
*INCLUDE YCL115_002_F01.  "서브루틴
